Revit 2027 API
BuiltInFailures.FamilyFailures.DeletingBadFamElemError Property
 Family contains invalid elements. They will be deleted.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId DeletingBadFamElemError { get; }
Public Shared ReadOnly Property DeletingBadFamElemError As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ DeletingBadFamElemError {
	FailureDefinitionId^ get ();
}
static member DeletingBadFamElemError : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.FamilyFailures Class
Autodesk.Revit.DB Namespace